nemotron-3-nano-omni-30b-a3b-reasoning/nvfp4/J_monday-burst.log
INFO 05-03 08:39:58 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 05-03 08:39:58 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xecb5520e42c0>, trust_remote_code=False, seed=42, num_prompts=300, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4000, random_output_len=500, random_range_ratio='0.9', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=25, model='nvidia/Nemotron-3-Nano-Omni-30B-A3B-Reasoning-NVFP4', input_len=None, output_len=None, tokenizer='nvidia/Nemotron-3-Nano-Omni-30B-A3B-Reasoning-NVFP4', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.5, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='J_monday-burst.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-379d7df4-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='nemotron-3-nano-omni-30b-nvfp4', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
[transformers] You are using a model of type `NemotronH_Nano_Omni_Reasoning_V3` to instantiate a model of type ``. This may be expected if you are loading a checkpoint that shares a subset of the architecture (e.g., loading a `sam2_video` checkpoint into `Sam2Model`), but is otherwise not supported and can yield errors. Please verify that the checkpoint is compatible with the model you are instantiating.
INFO 05-03 08:40:00 [utils.py:90] Sampling input_len from [399, 7600] and output_len from [49, 950]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.5
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 25
100%|██████████| 300/300 [08:36<00:00,  1.72s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     300       
Failed requests:                         0         
Maximum request concurrency:             25        
Request rate configured (RPS):           1.50      
Benchmark duration (s):                  516.11    
Total input tokens:                      1203008   
Total generated tokens:                  150317    
Request throughput (req/s):              0.58      
Output token throughput (tok/s):         291.25    
Peak output token throughput (tok/s):    426.00    
Peak concurrent requests:                28.00     
Total token throughput (tok/s):          2622.17   
---------------Time to First Token----------------
Mean TTFT (ms):                          874.64    
Median TTFT (ms):                        686.61    
P50 TTFT (ms):                           686.61    
P90 TTFT (ms):                           1437.95   
P95 TTFT (ms):                           2151.21   
P99 TTFT (ms):                           4462.05   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          81.42     
Median TPOT (ms):                        82.06     
P50 TPOT (ms):                           82.06     
P90 TPOT (ms):                           88.78     
P95 TPOT (ms):                           90.98     
P99 TPOT (ms):                           97.82     
---------------Inter-token Latency----------------
Mean ITL (ms):                           80.55     
Median ITL (ms):                         62.36     
P50 ITL (ms):                            62.36     
P90 ITL (ms):                            75.92     
P95 ITL (ms):                            208.76    
P99 ITL (ms):                            523.41    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          41189.70  
Median E2EL (ms):                        40826.83  
P50 E2EL (ms):                           40826.83  
P90 E2EL (ms):                           72814.14  
P95 E2EL (ms):                           75952.16  
P99 E2EL (ms):                           80042.79  
==================================================